[
{"country": "From United Kingdom", "title": "Good for all levels", "link": "www.amazon.co.uk/gp/customer-reviews/R2DTPRWJ166EET?ASIN=B08FBJ3B1S", "stars": 5, "content": "I’ve been building web apps for almost a decade and Neo4j is my favourite tool when it comes to graphs. I enjoyed the practical examples with React and GraphQL and the section about spatial analysis goes in incredible detail. I’m not much into machine learning but the chapter about it definitely sparked my interest and also the relationship prediction one draw my attention - so whether your a pro or a newcomer as long as you love graphs you will find the right chapter. - Also, If you are using javascript you’ll find handy this open source npm package to build cypher queries: fluent-cypher."},
{"country": "From the United States", "title": "Inspiring, practical ideas for graph data scientists", "link": "www.amazon.com/gp/customer-reviews/R1HI9BLN94YR3E?ASIN=B08FBJ3B1S", "stars": 5, "content": "I received a copy of this book from the publisher so that I could review it. - This book does a great job of introducing a range of graph-related topics along with code examples to illustrate the points. It is a practical guide written by someone who is well grounded in theory. The author's experience as a data scientist helps her bring together various tools in the Neo4j ecosystem that you might use on a real project. You aren't just getting a single vendor's sales pitch. Sometimes data scientists struggle with the ML Ops required to turn a great model into a production tool. The book takes the reader all the way through ideas for deploying graph analytics in an application and tuning the database in production. This sets the book apart from others that I have read on applied graph analytics. - The section on spatial data is especially well done, as the author has been a major contributor to the Neo4j community in that area. The chapters on machine learning are also deep and valuable. - In order to explain graph algorithms, the book provides examples in pure Python before showing the way to call Neo4j's implementation. I found myself skimming/skipping the pure Python explanations since Neo4j provides these algorithms out of the box. - The book attempts to explain concepts from the ground up, but you will get more from this book if you have some experience with machine learning, Neo4j, and Python. For a data scientist or analyst looking to add to graph analytics to your tool kit, this will be a valuable resource and a source of inspiration."},
{"country": "From the United States", "title": "Great way to get started exploring the capabilities of Neo4j", "link": "www.amazon.com/gp/customer-reviews/R301PFTNLG75RB?ASIN=B08FBJ3B1S", "stars": 5, "content": "Estelle's book is an incredibly clear breakdown of how to make the most out of Neo4j and all it's capabilities. She does a fantastic job of explaining how to conceptualize \"graphy\" problems and then use Neo4j to solve them. If you're new to graphs and Neo4j or if you're an experienced graphista, this books is going to have something for you."},
{"country": "From the United States", "title": "Great introductory", "link": "www.amazon.com/gp/customer-reviews/R2I93C4QUF87GA?ASIN=B08FBJ3B1S", "stars": 5, "content": "Estelle did a great job introducing Neo4j from the lenses of graph analytics."},
{"country": "From Germany", "title": "This is more than a handson analytics graph set of knowledge", "link": "www.amazon.de/-/en/gp/customer-reviews/R58X2VG7TULU7/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B08FBJ3B1S", "stars": 5, "content": "This is more than a handson analytics graph set of knowledge. For those who are dealing with real scenarios for graphs like Knowledge System (my case), this book gives many insights on how to tackle some graph challenges, especially exploring them through different approaches, such as using machine learning libraries already established in the Data Science community, coding python graph algorithms step-by-step, and sure enough using Neo4j Graph Data Science resources. In general, the book goes beyond the tasks related to graph analytics, since the book moves well from the duties of data engineering, analytics and data science itself, as well as operational application architecture. - WHAT I LIKE: From the chapter 6th until the 11th the book has a really insighful coverage for the most relevant Graph-based Machine Learning algorithms and approaches using quite interesting use-cases. The book goes further, covering even more advanced Deep Learning models atop graph algorithms. - WHAT I WOULD LIKE TO SEE: Since the book quite properly addresses some Deep Learning capabilities, it would be very important that it could also bring a scenario of high data scale, and for these cases the setup of the Neo4j environment becomes a very sensitive subject. That said, I miss more information about the Neo4j distributed storage capacities and partitioning rules of the model (sharding, multi-db, multi-tenancy) for scenarios of hundreds of thousands of nodes or even billions."},
{"country": "From Germany", "title": "Get things done with graph analytics and ML", "link": "www.amazon.de/-/en/gp/customer-reviews/RG294RUXJ0KGY/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B08FBJ3B1S", "stars": 5, "content": "I must say that this book delivers what the title promises - and more, actually. If you are looking for a guide on building your first end-to-end application with Neo4j graph database and its Graph Data Science library, this is a great choice. Yes, you’ll get a good introduction into graph analytics and graph algorithms. But what is just as important for getting things done is that you’ll get a good introduction to the whole workflow from raw data through ingestion and analytics to final results and visualisations. All that with concrete examples and code. I find this highly valuable. - As a data scientist, I especially appreciate Section 2 (graph algorithms) and I get excited with Section 3 (Machine Learning on graphs). All is well explained and discussed, there are fundamental basics with practical examples and even code implementations - and of course, examples using the GDS library. I would appreciate more detailed technical discussions and evaluations of graph algorithms, but truth be told, that would be well out of scope of a single book. - Altogether I'd recommend this to anyone exploring graph analytics and ways to find additional value in connected data. And it even provides a good introduction into graph-based ML, such as nice explanation of graph neural networks. I hope Estelle is not done writing:)"},
{"country": "From Germany", "title": "Machine Learning on Graphs", "link": "www.amazon.de/-/en/gp/customer-reviews/RLJFPTI1RCR8Z/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B08FBJ3B1S", "stars": 5, "content": "This book has provided me with fantastic insight on how to develop my analysis and machine learning models using a graph data structure. Of particular interest to me is how to set-up a solid data science project for using graph-based features in machine learning. In addition, Chapter 10 leads me through the principles on graph embedding and how I can work with them and utilize their features in Neo4j. Thanks Estelle, this will be a valuable reference for me going forward in my projects."},
{"country": "From the United States", "title": "I loved reading this book", "link": "www.amazon.com/gp/customer-reviews/R1EKBRCAS054VU/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B08FBJ3B1S", "stars": 5, "content": "Disclaimer: The Publisher asked me to review this book and sent me a review copy. I promise to be completely honest about my thoughts on this book. - This book describes the concepts of Neo4j with good examples, specially I liked the example of comparing data with water, a container with database and it very nicely explained the way of choosing an appropriate container based on need. - Further this book also gives us a clear understanding on Cypher Query Language with sample code. Covered almost all of the concepts starting from creating a node to managing it and modify / update them, including loading the data from CSV or JSON format or web APIs. From time-to-time the author has also taken care of comparing Neo4j with other database terminology and shared related terms considering that this book will also be read by various database users, and it made me more comfortable when doing comparison with the database I am used to. In this book the author has demonstrated the power of Neo4j by building a knowledge graph from unstructured data with detailed explanation of geographic coordinate systems. Which is very hard to do with various other databases. Author did not leave us with just the concepts and hands-on with Neo4j, she also taken us from novice to expert and included Data Science/Machine Learning portion as well which is booming now! - Another important thing I liked is that the author has taken care of small concepts & tips and has explained them clearly, as they are the building blocks. Along with this, there are some exercises to test the understanding. \"Tip\" section in the book is awesome, as it contains very important tips which one has to keep them handy. This book is worth reading irrespective who you are, be it a Beginner (to gain fundamental knowledge on Neo4j); Full-stack developer (Where and when to use Neo4j with Python or any other language); database developer (how to create; manage and maintain database); or a data scientist & ML engineer (Data Analysis and Prediction with Python and Neo4j); etc. It covers all aspects of Neo4j. - I loved reading this book."},
{"country": "From the United States", "title": "Great introductory", "link": "www.amazon.com/gp/customer-reviews/R2I93C4QUF87GA/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B08FBJ3B1S", "stars": 5, "content": "Estelle did a great job introducing Neo4j from the lenses of graph analytics."},
{"country": "From the United States", "title": null, "link": "www.amazon.comNone", "stars": 5, "content": "Estelle goes straight to the point in her book she manages to pick up beginners as well as seniors, which she does by clearly and comprehensively building up the respective theoretical aspects with a direct forwarding to the implementation and engineering part. Pure hands-on! - For me as an engineer who must jump from project to project the practical part and the implementation is relevant. Thanks to the book I have taken new aspects of Neo4j with me that have been directly incorporated into two business projects. - Estelle also has a heart for Natural Language Processing! Language and its construction are based on relationships and so the connection is obvious. Using spaCy to construct Cypher queries for Neo4j from pure written English – wonderful! - This book is a must-read for anyone who wants a quick and straight forward introduction to Graph Technology with Neo4j and its practical implementations."}
]
